Revit 2026 API

# ApplicationNewPointOnFace Method

---

Construct a PointOnFace object which is used to define the placement of a ReferencePoint given a reference and a location on the face.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointOnFace NewPointOnFace(
	Reference faceReference,
	UV uv
)
```
```vb
Public Function NewPointOnFace (
	faceReference As Reference,
	uv As UV
) As PointOnFace
```
```cpp
public:
PointOnFace^ NewPointOnFace(
	Reference^ faceReference,
	UV^ uv
)
```
```fsharp
member NewPointOnFace :
        faceReference : Reference *
        uv : UV -> PointOnFace
```

#### Parameters

faceReference Reference
    The reference whose face the object will be created on.
uv UV
    A 2-dimensional position.

#### Return Value

PointOnFaceA new PointOnFace object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument faceReference or uv is . |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace